%for tests
%A = [1/4 3/4;1 1/2];
%[V D] = eig(A)
syms a b c;
f = @(x) a*x^2 + b*x + c;
g = solve(f);
x1 = g(1);
x2 = g(2);
a = 1/60;
b = -200;
c = 597750;
double(subs(x1));
double(subs(x2));
roots([a,b,c]);

%第二章，矩阵
A = [10 -7 0; -3 2 6; 5 -1 5];
b = [7 4 6];
b = b';
x = A\b;
[L U P] = lutx(A);
A2 = [10 -7 0; -3 2.099 6; 5 -1 5];
b2 = [7 3.901 6]';
x2 = A2\b2;
x2 = bslashtx(A,b);

A = [1 0 0 0;0 1 0 0; 0 0 1 0; 0 0 0 1];
S = sparse(A);
x = [1 2 3 4];
y = [1 2 3 4];%x，y对应哪些位置有元素
i = [1 2 3 4];%i对应元素的值
S2 = sparse(x,y,i,4,4);
norm(full(S2));

%第三章，插值
x = 0:3;
y = [-5 -6 -1 16];
symx = sym('x');
Fx =  polyinterp(x,y,symx);
simplify(Fx);

x =   [0.7337
    0.6545
    0.5406
    0.4351
    0.2948
    0.2760
    0.3740
    0.4677
    0.3573
    0.2323
    0.1767
    0.1899
    0.2455
    0.3198
    0.4142
    0.4156
    0.3476
    0.2677
    0.1976
    0.1462
    0.1420
    0.1740
    0.2628
    0.3316
    0.4267
    0.4455
    0.3392
    0.2517
    0.2073
    0.2170
    0.2719
    0.3483
    0.4399
    0.5441
    0.5767
    0.5122
    0.4677
    0.4399
    0.4767
    0.5503
    0.6024
    0.6670
    0.7622
    0.7885];
y =    [0.1428
    0.1029
    0.0950
    0.0737
    0.0896
    0.1614
    0.1866
    0.2251
    0.2450
    0.2809
    0.3167
    0.3818
    0.3871
    0.3765
    0.3699
    0.3858
    0.4031
    0.4402
    0.4602
    0.4947
    0.5465
    0.5810
    0.5691
    0.5637
    0.5345
    0.5438
    0.6235
    0.6939
    0.7709
    0.8147
    0.8121
    0.7789
    0.7231
    0.6965
    0.7058
    0.7669
    0.8307
    0.9263
    0.9701
    0.9210
    0.8718
    0.7908
    0.5916
    0.4827];

n = length(x);
t = (1:0.05:n)';
s = (1:n)';
u = splinetx(s,x,t);
v = splinetx(s,y,t);
%plot(x,y,'.',u,v,'-');


%第四章，方程求根
F = @(x) x.^3-2*x-5;
%%plot(x,y,'g',x,0,'r');
%grid on;  %起划分栅格的作用
x0 = fzerotx(F,[-5 5]);
x = -5:0.05:5;
y = F(x);
%%plot(x,y,'k-');
%hold on;%图不消失,接下去可以再使用plot
%line([-5 5],[0 0]);%画直线x从-5到5，y从0,0
%%plot(x0,0,'r:o');%另外可以用bar绘制直方图


%{
%题4_10 : T(x,t) = Ts+(Ti-Ts)*erf(x/2*(at)^0.5)\
syms Ts Ti a t x
T(x,t) = Ts+(Ti-Ts)*erf(x/(2*(a*t)^0.5));

t =  subs(T,{Ts Ti a t},{20 -15 0.138e-6,60*86400});
Ts = 20;
Ti = -15 ;
a = 0.138e-6;
t = 60*86400;
f = @(x) -15+35*erf(x/(2*(60*86400*0.138e-6)^0.5));
fzerotx(f,[0,1]);
%{
得到了
ans =
   0.676961854481936
%}
%}

%第五章，最小二乘法
t = 1:25;
y = [ 5.0291  6.5099  5.3666  4.1272  4.2948 ...
      6.1261 12.5140 10.0502  9.1614  7.5677 ...
      7.2920 10.0357 11.0708 13.4045 12.8415 ...
     11.9666 11.0765 11.7774 14.5701 17.0440 ...
     17.0398 15.9069 15.4850 15.5112 17.6572];
X = [ones(size(t)) ; t ; sin(t)]';

b = X\(y');%得到基函数的各个系数
%也可以用函数ployfit/
a = polyfit(t,y,1);
ya = polyval(a,t);
%%plot(t,ya);
s = 1:0.05:25;%将t进一步细分，方便画图
y1 = [ones(size(s)) ; s ; sin(s)]'*b;%细分得到的函数值
%figure(1);
%%plot(t,y,'.',s,y1,'r-');
%hold on
%去除数组成员的方法：
t(7) = [];
y(7) = [];
X = [ones(size(t)) ; t ; sin(t)]';
c = X\(y');%得到基函数的各个系数
y2 = [ones(size(s)) ; s ; sin(s)]'*c;%细分得到的函数值
%figure(2)
%%plot(s,y2,'k-');
%{
c =
    3.1536
    0.5869
    1.9733
%}


%第六章，数值积分
beta =@(t,w,z) t.^(z-1)*(1-t).^(w-1);
z = 8/3;
w = 10/3;
tol = 10e-6;
Q = quadtx(beta,0,1,tol,z,w);%如果使用[0 1]则出错

clear;
A = @(x) x.^2;
x = -5:0.05:5;
y = A(x);
T1 = sum(diff(x).*(y(1:end-1)+y(2:end))/2);%求离散数据积分的公式
T2 = quadtx(A,-5,5);%如果使用[-5 5]则出错

%第七章，常微分方程
%1）用符号法：
dsolve('D2x = -x','t');
f = @(t,y) 0;
[xm ym] = ode23tx(f, [0 pi/2], 0);

%假如方程是高阶的，其输出最好不要直接画图出来。要选择第一列
[tm ym] = ode15s('testvdp',[0 3000], [2 0]);
%%plot(tm,ym(:,1),'-');
%下面演示一下求解D2x = -x,先用dsolve，再用数值方法求解,设初值是0
G = dsolve('D2x = -x','x(0)=0','Dx(0)=1');%得到sin(t)
tn = -pi:0.05:pi;
y = subs(G,sym('t'),tn);%用符号求出来的解可以用这种方式换成数值
%%plot(tn,y,'o');
hold on;
%然后使用数值方法求：另x = y1,Dx = y2,初值为y1=0,y2=1那么方程可以化为：
%Dy2 = -y1;Dy1 = y2
%故，F(2) = -y(1),F(1) = y(2);
F =@(t,y) [y(2);-y(1)];
F1 = @(t,y) [y(2)*y(3);-y(1)*y(3);-0.51*y(1)*y(2)];
[tm ym] = ode23tx(F,[-pi pi],[1 0]);
[tp yp] = ode23tx(F1,[0 12],[0 1 1]);
%得到的ym中包含了y(1)和y(2)的解，也就是分别对应于x和Dx，不信的话可以画出来
%plot(tm,ym(:,1),'-',tm,ym(:,2),'.');
hold on;
%plot(tp,yp(:,1),'g-',tp,yp(:,2),'r-',tp,yp(:,3),'o')
%还是用dsolve比较好……

clear;
%第八章，傅里叶分析
t=[0:0.0001:0.2];  %t为2001个点
n=length(t);
y=sin(50*(2*pi)*t); 
Y=fft(y);  %这个得到的Y是虚数，而且是一维的，与频率的关系还没有建立.
length(Y)
Fs=10000;  %采样频率，采样的间隔点时间为周期T=0.0001, 频率f=1/T
f=(0:n/2)*Fs/n; %这就是fft分析出的最高频率是采样频率的一半，频率段是从零开始的。
pow=abs(Y(1:n/2+1));%求它的幅值,这里没有表示相位随频率的变化
%figure(1);
%%plot(f,pow);
%%axis([0 300 0 70])
%%figure(2);
%%plot([f; f],[0*pow;pow]);
%%axis([0 300 0 70])

%第九章，随机数
yrandn = rand(1,1000);
x = 1:1000;
k = normrnd(0,1,100);%均值为0，标准差为1，100个随机数
clear;

%第十章，特征值与奇异值
A=[-149 -50 -154;537 180 546;-27 -9 -25];
[V,D]=eig(A);
%得到的V的各个列向量为特征值，对应每一列的特征值
%以下进行检验:所得到的差值都是10e-11次方的数量级
1*V(:,1) - A*V(:,1);
2*V(:,2) - A*V(:,2);

%第十一章，偏微分方程

%使用pdetool即可，按步骤操作

%附：求精确的微分和积分：
syms t x
y = t^2+t*x;
dy_dt = diff(y,t,2) ; %y对t，2阶导
quad_y = simplify(int(y,x)) ; %y对x，不定积分，

f = x^2;
quad_f = int(f,0,1) ; %f对x，定积分，


solve('2*x = x-1')





