%{ 
据题可知，关于各节点，其中1、和8节点所受外力未知，
因此无法列出受力方程，因此能列出受力方程的节点有12个，再加上8节点水平方向的一个，
刚好有13个方程，一共有13根杆，因此这是一个有唯一解的问题


设各个杆所受力为T1 ?? T13
cos_sin = sqrt(0.5);

对于节点3，受力平衡方程为：
T3 - T1*cos_sin - T5*cos_sin = 0;
T1*cos_sin - T5*cos_sin - T4 = 0;

对于节点2，受力平衡方程为：
T3 - 10 = 0;
T2 - T6 = 0;

对于节点4，受力平衡方程为：
T4 - T8 = 0;
T7 = 0;

%对于节点5：
T7 - 15 - T5*cos_sin - T9*cos_sin = 0;
T6 - T10 - T9*cos_sin + T5*cos_sin = 0;

对于节点6：
T11 - 20 = 0;
T10 - T13 = 0;


对于节点7：
T11 - T9*cos_sin - T12*cos_sin = 0;
T8 + T9*cos_sin - T12*cos_sin = 0;

对于节点8：
T13 + T12*cos_sin = 0;
%}

%{
整理得到：
 -T1*cos_sin + T3 - T5*cos_sin      = 0;
    T1*cos_sin - T4 -  T5*cos_sin   = 0;
            T3                      = 10;
        T2 - T6                     = 0;
            T4 - T8                 = 0;
                T7                  = 0;
    -T5*cos_sin + T7  - T9*cos_sin  = 15;
 T5*cos_sin + T6 - T9*cos_sin - T10 = 0;
                                T11 = 20;
                          T10 - T13 = 0;
     T9*cos_sin + T11 - T12*cos_sin = 0;
      T8 + T9*cos_sin - T12*cos_sin = 0;
                   T12*cos_sin + T13= 0;
%}
cos_sin = sqrt(0.5);
-cos_sin
%Ax = B;
B = [0; 0; 10; 0; 0; 0; 15; 0; 20; 0; 0; 0; 0;]
A = [-cos_sin 0 1 0 cos_sin 0 0 0 0 0 0 0 0;
      cos_sin 0 0 -1 cos_sin 0 0 0 0 0 0 0 0;
      0 0 1 0 0 0 0 0 0 0 0 0 0;
      0 1 0 0 0 -1 0 0 0 0 0 0 0;
      0 0 0 1 0 0 0 -1 0 0 0 0 0;
      0 0 0 0 0 0 1 0 0 0 0 0 0;
      0 0 0 0 -cos_sin 0 1 0 -cos_sin 0 0 0 0;
      0 0 0 0 cos_sin 1 0 0 -cos_sin -1 0 0 0;
      0 0 0 0 0 0 0 0 0 0 1 0 0;
      0 0 0 0 0 0 0 0 0 1 0 0 1;
      0 0 0 0 0 0 0 0 cos_sin 0 1 -cos_sin 0;
      0 0 0 0 0 0 0 1 cos_sin 0 0 -cos_sin 0;
      0 0 0 0 0 0 0 0 0 0 0 cos_sin 1;]
x = A\B
t = 1000*9.8*x
%{
得到结果：（单位是1000kg*重力加速度 g）
x =

   21.2132    
  -25.0000
   10.0000
   20.0000
    7.0711
  -25.0000
         0
   20.0000
  -28.2843
         0
   20.0000
         0
         0
加上单位后（N）：
t =

   1.0e+05 *

    2.0789      T1为拉力
   -2.4500      T2为压力
    0.9800      T3为压力
    1.9600      T4为拉力
    0.6930      T5为拉力
   -2.4500      T6为压力
         0  
    1.9600      T8为拉力
   -2.7719      T9为压力
         0
    1.9600      T11为压力
         0
         0

%}

