F = @(t,y) -1000*(y-sin(t))+cos(t);

%----------(a) dsolve:求精确解！
y = dsolve('Dy = -1000*(y-sin(t))+cos(t)','y(0) = 1')

%----------(b) ode23tx:
[t1,yb] = ode23tx(F,[0 1],1);
steps_b = length(t1) - 1

%----------(c) ode23s:
[t2,yc] = ode23s(F,[0 1],1);
steps_c = length(t2) - 1

%----------(d)(e)(f)
subplot(2,1,1)
plot(t1,yb,'.',t2,yc,'o');

%0.005-0.01处变化最快，因此取这一部分单独画出来:
subplot(2,2,3)
plot(t1(16:25),yb(16:25),'.',t2(21:32),yc(21:32),'o');

%0.6-0.7处变化较为缓慢，因此这一部分也单独画出来：
subplot(2,2,4)
plot(t1(250:302),yb(250:302),'.',t2(48:51),yc(48:51),'o');